In [1]:
import numpy as np
import pandas as pd

In [2]:
data = [[9.9, 8.8], [np.nan, 6.6],[7.7, np.nan],  [0.99, 9.8]]
df = pd.DataFrame(data, columns=["first", "second"], index=["a", "b", "c", "d"]) 
df

   first  second
a   9.90     8.8
b    NaN     6.6
c   7.70     NaN
d   0.99     9.8

In [3]:
df.sum(axis=0)

first     18.59
second    25.20
dtype: float64

In [4]:
df.sum(axis=1)

a    18.70
b     6.60
c     7.70
d    10.79
dtype: float64

In [6]:
#df.sum?

In [7]:
df

   first  second
a   9.90     8.8
b    NaN     6.6
c   7.70     NaN
d   0.99     9.8

In [8]:
df['first'].sum()

18.59

In [9]:
df['second'].mean()

8.4

In [10]:
df.loc['a'].sum()

18.700000000000003

In [11]:
df.mean(axis=1, skipna=False)

a    9.350
b      NaN
c      NaN
d    5.395
dtype: float64

In [12]:
first_mean = df.mean(axis=0)['first']

In [13]:
second_min = df.min(axis=0)['second']

In [14]:
df

   first  second
a   9.90     8.8
b    NaN     6.6
c   7.70     NaN
d   0.99     9.8

In [15]:
df['first'] = df['first'].fillna(value=first_mean)

In [16]:
df['second'] = df['second'].fillna(value=second_min)

In [17]:
df

      first  second
a  9.900000     8.8
b  6.196667     6.6
c  7.700000     6.6
d  0.990000     9.8

In [18]:
df2 = pd.DataFrame(np.random.randn(6, 4),
                   columns=["A", "B", "C", "D"],
                   index=pd.date_range("20180220", periods=6)) 
df2

                   A         B         C         D
2018-02-20  0.190794  0.378614 -0.758124 -0.387111
2018-02-21  0.753806 -1.872854 -0.746217 -0.394940
2018-02-22  0.903633  1.019463  1.061723  0.018263
2018-02-23  2.704307 -0.887994 -0.732248  0.839346
2018-02-24 -2.589921  0.687551  0.566321  0.042444
2018-02-25 -0.183368 -1.991175  2.101720  2.031385

In [19]:
df2.corr()

          A         B         C         D
A  1.000000 -0.301513 -0.388816  0.098372
B -0.301513  1.000000 -0.036524 -0.517148
C -0.388816 -0.036524  1.000000  0.670680
D  0.098372 -0.517148  0.670680  1.000000

In [20]:
df2['A'].corr(df2['B'])

-0.3015128851236897

In [21]:
df2['B'].corr(df2['C'])

-0.03652399220304839

In [22]:
df2['C'].cov(df2['D'])

0.7503015446731468

In [23]:
df2['C'].corr(df2['D'])

0.6706801177949271

In [24]:
df2.cov()

          A         B         C         D
A  2.989629 -0.688922 -0.804574  0.158997
B -0.688922  1.746266 -0.057763 -0.638818
C -0.804574 -0.057763  1.432277  0.750302
D  0.158997 -0.638818  0.750302  0.873803

In [25]:
dates = df2.index
# permutation 은 치환
random_dates = np.random.permutation(dates)
# 무작위로 섞어봄. index 순서와 컬럼의 순서가 불규칙하게 변함
df2 = df2.reindex(index=random_dates, columns=["D", "B", "C", "A"])

In [26]:
df2

                   D         B         C         A
2018-02-23  0.839346 -0.887994 -0.732248  2.704307
2018-02-22  0.018263  1.019463  1.061723  0.903633
2018-02-25  2.031385 -1.991175  2.101720 -0.183368
2018-02-20 -0.387111  0.378614 -0.758124  0.190794
2018-02-21 -0.394940 -1.872854 -0.746217  0.753806
2018-02-24  0.042444  0.687551  0.566321 -2.589921

In [27]:
df2.sort_index(axis=0)

                   D         B         C         A
2018-02-20 -0.387111  0.378614 -0.758124  0.190794
2018-02-21 -0.394940 -1.872854 -0.746217  0.753806
2018-02-22  0.018263  1.019463  1.061723  0.903633
2018-02-23  0.839346 -0.887994 -0.732248  2.704307
2018-02-24  0.042444  0.687551  0.566321 -2.589921
2018-02-25  2.031385 -1.991175  2.101720 -0.183368

In [28]:
df2.sort_index(axis=1)

                   A         B         C         D
2018-02-23  2.704307 -0.887994 -0.732248  0.839346
2018-02-22  0.903633  1.019463  1.061723  0.018263
2018-02-25 -0.183368 -1.991175  2.101720  2.031385
2018-02-20  0.190794  0.378614 -0.758124 -0.387111
2018-02-21  0.753806 -1.872854 -0.746217 -0.394940
2018-02-24 -2.589921  0.687551  0.566321  0.042444

In [29]:
#df2.sort_index?

In [30]:
df2

                   D         B         C         A
2018-02-23  0.839346 -0.887994 -0.732248  2.704307
2018-02-22  0.018263  1.019463  1.061723  0.903633
2018-02-25  2.031385 -1.991175  2.101720 -0.183368
2018-02-20 -0.387111  0.378614 -0.758124  0.190794
2018-02-21 -0.394940 -1.872854 -0.746217  0.753806
2018-02-24  0.042444  0.687551  0.566321 -2.589921

In [31]:
df2.sort_index(axis=0, ascending=False)

                   D         B         C         A
2018-02-25  2.031385 -1.991175  2.101720 -0.183368
2018-02-24  0.042444  0.687551  0.566321 -2.589921
2018-02-23  0.839346 -0.887994 -0.732248  2.704307
2018-02-22  0.018263  1.019463  1.061723  0.903633
2018-02-21 -0.394940 -1.872854 -0.746217  0.753806
2018-02-20 -0.387111  0.378614 -0.758124  0.190794

In [32]:
df2.sort_index(axis=1, ascending=False)

                   D         C         B         A
2018-02-23  0.839346 -0.732248 -0.887994  2.704307
2018-02-22  0.018263  1.061723  1.019463  0.903633
2018-02-25  2.031385  2.101720 -1.991175 -0.183368
2018-02-20 -0.387111 -0.758124  0.378614  0.190794
2018-02-21 -0.394940 -0.746217 -1.872854  0.753806
2018-02-24  0.042444  0.566321  0.687551 -2.589921

In [33]:
df2

                   D         B         C         A
2018-02-23  0.839346 -0.887994 -0.732248  2.704307
2018-02-22  0.018263  1.019463  1.061723  0.903633
2018-02-25  2.031385 -1.991175  2.101720 -0.183368
2018-02-20 -0.387111  0.378614 -0.758124  0.190794
2018-02-21 -0.394940 -1.872854 -0.746217  0.753806
2018-02-24  0.042444  0.687551  0.566321 -2.589921

In [35]:
#df2.sort_values?

In [36]:
df2.sort_values(by='D')

                   D         B         C         A
2018-02-21 -0.394940 -1.872854 -0.746217  0.753806
2018-02-20 -0.387111  0.378614 -0.758124  0.190794
2018-02-22  0.018263  1.019463  1.061723  0.903633
2018-02-24  0.042444  0.687551  0.566321 -2.589921
2018-02-23  0.839346 -0.887994 -0.732248  2.704307
2018-02-25  2.031385 -1.991175  2.101720 -0.183368

In [37]:
df2.sort_values(by='B', ascending=False)

                   D         B         C         A
2018-02-22  0.018263  1.019463  1.061723  0.903633
2018-02-24  0.042444  0.687551  0.566321 -2.589921
2018-02-20 -0.387111  0.378614 -0.758124  0.190794
2018-02-23  0.839346 -0.887994 -0.732248  2.704307
2018-02-21 -0.394940 -1.872854 -0.746217  0.753806
2018-02-25  2.031385 -1.991175  2.101720 -0.183368

In [40]:
df2["E"] = np.random.randint(0, 6, size=6)
df2["F"] = ["first", "second", "first", "third", "first", "second"]

In [41]:
df2

                   D         B         C         A  E       F
2018-02-23  0.839346 -0.887994 -0.732248  2.704307  0   first
2018-02-22  0.018263  1.019463  1.061723  0.903633  5  second
2018-02-25  2.031385 -1.991175  2.101720 -0.183368  2   first
2018-02-20 -0.387111  0.378614 -0.758124  0.190794  1   third
2018-02-21 -0.394940 -1.872854 -0.746217  0.753806  0   first
2018-02-24  0.042444  0.687551  0.566321 -2.589921  1  second

In [42]:
df2.sort_values(by=['E','F'])

                   D         B         C         A  E       F
2018-02-23  0.839346 -0.887994 -0.732248  2.704307  0   first
2018-02-21 -0.394940 -1.872854 -0.746217  0.753806  0   first
2018-02-24  0.042444  0.687551  0.566321 -2.589921  1  second
2018-02-20 -0.387111  0.378614 -0.758124  0.190794  1   third
2018-02-25  2.031385 -1.991175  2.101720 -0.183368  2   first
2018-02-22  0.018263  1.019463  1.061723  0.903633  5  second

In [43]:
df2['F'].unique()

array(['first', 'second', 'third'], dtype=object)

In [44]:
df2['F'].value_counts()

first     3
second    2
third     1
Name: F, dtype: int64

In [45]:
df3 = pd.DataFrame(np.random.randn(4, 3), columns=["b", "d", "e"],
                   index=["Seoul", "Incheon", "Busan", "Daegu"])  
df3

                b         d         e
Seoul   -0.589925  1.093098 -1.376563
Incheon  0.604831  1.028401 -0.329153
Busan   -1.201493  0.310182 -0.578776
Daegu   -0.319419  0.052277 -1.369009

In [52]:
my_func = lambda x : x.max() - x.min()

In [53]:
df3.apply(my_func, axis=0)

b    1.806324
d    1.040821
e    1.047410
dtype: float64

In [54]:
df3.apply(my_func, axis=1)

Seoul      2.469662
Incheon    1.357554
Busan      1.511675
Daegu      1.421286
dtype: float64

In [55]:
df3.apply( lambda x : x.max() - x.min() , axis=0)

b    1.806324
d    1.040821
e    1.047410
dtype: float64

In [51]:
#df3.apply?
# docstring. 함수를 인자값으로 받는 함수 -> HOF(고차함수, 고계함수)
# f3.apply(func, axis=0, ...)